CSI API ETABS v1

# cDesignCompositeColumnSetComboStrength Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int SetComboStrength(
    	string Name,
    	bool Selected
    )

    Function SetComboStrength (
    	Name As String,
    	Selected As Boolean
    ) As Integer

    Dim instance As cDesignCompositeColumn
    Dim Name As String
    Dim Selected As Boolean
    Dim returnValue As Integer

    returnValue = instance.SetComboStrength(Name,
    	Selected)

    int SetComboStrength(
    	String^ Name,
    	bool Selected
    )

    abstract SetComboStrength :
            Name : string *
            Selected : bool -> int

#### Parameters

Name

    Type: SystemString

Selected

    Type: SystemBoolean

#### Return Value

Type: Int32

See Also

#### Reference

cDesignCompositeColumn Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com